for (let i = 2; i <=12; i = i + 2){
    console.log(`Вывожу четные числа от 2 до 12 через 'for' : ${i}`)
}

let i2 = 2
while (i2 <= 12) {
    console.log(`Вывожу четные числа от 2 до 12 через 'while' : ${i2}`)
    i2 = i2 + 2
}



for (let b = 10; b >= 1; b = b - 1) {
    console.log(`Вывожу числа от 10 до 1 через 'for' : ${b}`)
}

let b2 = 10
do {
    console.log(`Вывожу числа от 10 до 1 через 'while' : ${b2}`)
    b2--
} while ( b2 >= 1)










// 1) Выведите в консоль четные числа от 2 до 12, используйте цикл for и условие.
//  2) При помощи цикла for выведите в консоль числа от 10 до 1, в обратном порядке. 
//  3) Перепишите 1 и 2 цикл используя цикл while.



// let i = 0

// while (i < 10) {
//     i = i + 1
//     console.log(i)
// }

// do {
//     i++
//     console.log(i)
// } while ( i < 5)

// for (let i = 1; i <= 10; i++){
//     console.log(`Пройден ${i} круг`)
// }